[
    {
        "name": "Overgrown Sheltered Courts",
        "descriptions": [
            "Stepping outside, you find yourself in the overgrown basketball courts swallowed by nature. Tall grasses and vines obscure the cracked pavement. The skeletal remains of the basketball hoop creak in the breeze. A sense of desolation hangs in the air.",
            "Turning a corner, you stumble upon the entrance to what must have been the sheltered court, a place now cloaked in the embrace of nature's reclamation. Intricate patterns of sunlight filtered through the intertwined branches and overgrown leaves that had taken root above, casting a mottled carpet of light and shadow on the cracked pavement beneath your feet.",
            "As you tread deeper into the heart of this overgrown court, a sense of awe and reverence envelops you. The silence here is profound, save for the occasional rustle of leaves or the distant caw of a bird. Nature's palette has painted the walls with shades of green and bursts of vibrant flowers, a stark contrast to the muted tones of decay that surround you elsewhere in this post-apocalyptic world. You have completely explored the Overgrown Sheltered Courts, you should now proceed forward to another room.",
            "You trod around and chance upon basketball, miraculously intact albeit a bit deflated. You shoot for 3.....\nyou miss."
        ]
    },
    {
        "name": "Ransacked Canteen",
        "descriptions": [
            "You enter what used to be the canteen, now a scene of chaos. Tables and chairs are overturned, and the floor is littered with discarded wrappers and cans. A faint odor of spoiled food lingers.",
            "Your gaze is drawn to the remnants of a long-abandoned counter. Shelves that once held snacks and supplies are now empty, save for a few tattered packages and dust-covered wrappers. As you approach, you notice a shattered cash register, its drawer left hanging open, its contents taken long ago.",
            "A chill runs down your spine as you imagine the lives that once bustled here, the laughter that echoed off these walls, and the stories that were shared over simple meals. Now, the canteen stands as a haunting testament to the passage of time and the abrupt end of normalcy.",
            "The distant howl of wind underscores the silence that has settled over the canteen. The air is heavy with a mixture of nostalgia and loss. With a final look around, you step back, the weight of the past pressing against your shoulders, and exit the canteen, leaving its memories to the dust and debris. You have now fully explored the canteen and left the room."
        ],
        "monster": "Maggot-Infested Bird"
    },
    {
        "name": "Ruined Concourse",
        "descriptions": [
            "You stand amidst the crumbling pillars and shattered glass, the school's once vibrant concourse now lies in ruins. Faded CCA posters now cling to peeling walls, echoes of laughter replaced by eerie silence. The scent of dampness and decay fills the air",
            "You navigate through the remnants of what used to be gathering spots, the remains of benches and seating areas now offering a melancholic reminder of the vibrant life that once pulsed through these halls. Fallen ceiling tiles and shattered mosaics create a hazardous terrain, forcing you to tread carefully.",
            "As you venture further, you discover a mural that seems to have withstood the ravages of time better than most. Faded but still recognizable, it depicts a scene of unity and knowledge. The figures in the mural appear to be frozen in time, their aspirations and dreams now echoing in the empty corridors.",
            "A gust of wind stirs the air, and you catch the faint scent of musty books. You follow the scent, finding yourself in what used to be a library. The shelves, though stripped of their contents, stand as sentinels to the wisdom that once resided within these walls. A chair sits overturned beside a cracked table, as if someone had left in a hurry, leaving their stories and studies behind.",
            "With each step, you immerse yourself deeper into the history that clings to the ruins. You can almost hear the distant echo of youthful laughter and the shuffling of feet, as if the past is whispering its secrets to you. As you end your exploration, the realization sinks in: this place was once a thriving sanctuary of knowledge and community. Now, it stands as a testament to both the fragility of human achievement and the enduring power of nature's reclamation. You have fully explored this room, getting one step closer to obtaining your 'A' level certificate."
        ],
        "monster": "Abhorrently Large Cockroach"
    },
    {
        "name": "Forgotten Library",
        "descriptions": [
            "You push open the heavy door of the forgotten library, the creaking sound echoing through the dusty silence. The air inside is thick with the scent of aged paper and memories long past. Sunlight filters through the cracked windows, casting a golden glow on the motes of dust that dance in the air like tiny, suspended memories.",
            "Your footsteps disturb the quiet as you venture deeper into the library. The shelves, which were once meticulously organized, now stand as haphazard towers of forgotten knowledge. Books lean precariously, their spines worn and pages yellowed. Some have succumbed to the passage of time, their covers cracked and binding threads exposed.",
            "A shattered window on one side reveals a glimpse of the outside, where nature has begun to reclaim the land. Vines snake through the broken glass, their leaves rustling in the breeze like whispers of the past. A sense of melancholic beauty lingers in the juxtaposition of decay and life.",
            "As you continue to explore, you come across a reading nook that seems frozen in time. A solitary chair sits beside a small table, upon which rests an open book, its pages frozen mid-turn as if the reader had suddenly vanished. The scene evokes a poignant reminder of lives disrupted and stories left unfinished.",
            "In a corner, you discover a mural on the wall, faded but still discernible. It depicts a vibrant scene of children reading, their faces animated with wonder. The contrast between the mural's depiction of hope and the current state of the library speaks volumes about the passage of time and the resilience of human creativity.",
            "The sound of a distant howl drifts through a broken window, a reminder that the world has changed, evolved into something unrecognizable. But here, in this forgotten library, time holds its breath, preserving a slice of what once was, inviting back memories of you days you spent here mugging for the 'A' levels. You are even more determined to get you 'A' level certificate from the Final Boss. You have completely explored the room."
        ],
        "monster": "Lingering Bookworm"
    },
    {
        "name": "Abandoned Staff Room",
        "descriptions": [
            "Using the key card that you have found, you cautiously push open the door to the abandoned staff room. In front of you stretches an empty room, its lights flickering as old worksheets are strewn all over the place. The wooden floor is warped and cracked. Faded words are left on the whiteboard, noting down abscence of teachers and important admin information. A strange silence pervades the space.",
            "Your steps echo softly on the cracked linoleum floor as you enter. The room feels both familiar and eerie, the remnants of what used to be a hub of activity now shrouded in decay. Faded posters line the walls, their corners curling, showcasing long-forgotten events and reminders. A staff bulletin board holds a patchwork of notes and faded photographs, capturing moments of camaraderie that once brought life to this space. meow",
            "You weave your way around overturned chairs and broken furniture, your fingertips brushing against the dust that clings to every surface. A forgotten mug sits on the edge of a desk, its contents long evaporated, a relic of someone's last hurried moments. A bookshelf stands against one wall, its shelves holding a collection of worn-out textbooks and faded novels. A sense of longing lingers in the air, as if the room still yearns for the voices and laughter that once filled its corners.",
            "As you open a set of drawers, a gust of musty air escapes, carrying with it the scent of old paper and memories. You find papers, once important, now yellowed and brittle, crumbling at your touch. The sound of your own breathing seems loud in the stillness, as if you're disturbing the ghosts of the past that linger here.",
            "You tread lightly over debris strewn across the linoleum floor, your footsteps echoing in the eerie silence. The air is heavy with the scent of aged paper and decay, an unsettling blend that makes your heart race. The room's walls are adorned with faded educational posters, their once vibrant colors now muted by time. meow meow meow",
            "Your eyes scan the room, seeking any sign of the elusive final boss. A flickering fluorescent light above casts intermittent shadows, playing tricks on your perception. In one corner, a broken coffee machine stands as a relic of more ordinary times, while a toppled bookshelf leans against a wall, its contents of forgotten lesson plans and textbooks scattered haphazardly. MEOW MEOW MEOW MEOW MEOW",
            "The cat in your bag is literally having a seizure. "
        ],
        "monster": "Final Boss"
    }
]